# FamilySymbolProfile Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilySymbolProfile Class
Members See Also
---
Represents a family symbol based profile for sweep or swept blend elements.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class FamilySymbolProfile : SweepProfile
```

Visual Basic
---
```text
Public Class FamilySymbolProfile _
	Inherits SweepProfile
```

Visual C++
---
```text
public ref class FamilySymbolProfile : public SweepProfile
```

# Remarks
Use objects of this type in methods as NewSweep() and NewSweptBlend() in FamilyItemFactory to create the profile.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..SweepProfile Autodesk.Revit.DB..::..FamilySymbolProfile
# See Also
FamilySymbolProfile Members
Autodesk.Revit.DB Namespace